app/views/carts/show.html.erb

            <tr>
            <% cart_item = Product.find(cart_item_id) %>
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]