app/helpers/application_helper.rb

    def cart_for_user
        if current_user
            cart = Cart.where(user_id: current_user.id).last

            # If the user doesn't have a cart, grab the one from their session
            cart ||= Cart.where(session_id: request.session.id.to_s).last

            cart ||= Cart.create(session_id: request.session.id.to_s)

            cart.update(user_id: current_user.id)
        else
            cart = Cart.where(session_id: request.session.id.to_s).last
            cart ||= Cart.create(session_id: request.session.id.to_s)
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? ORDER BY "carts"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."session_id" = ? ORDER BY "carts"."id" DESC LIMIT ?  [["session_id", "5f57cd915d1b88249f8a373b8ff4025f"], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at", "session_id") VALUES (?, ?, ?)  [["created_at", "2023-03-14 01:37:05.414945"], ["updated_at", "2023-03-14 01:37:05.414945"], ["session_id", "5f57cd915d1b88249f8a373b8ff4025f"]]
UPDATE "carts" SET "updated_at" = ?, "user_id" = ? WHERE "carts"."id" = ?  [["updated_at", "2023-03-14 01:37:05.440595"], ["user_id", 1], ["id", 2]]
SELECT "carts".* FROM "carts" WHERE "carts"."session_id" = ? ORDER BY "carts"."id" DESC LIMIT ?  [["session_id", "750f7f6480d4a8611df9b0eb7d7e1fea"], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at", "session_id") VALUES (?, ?, ?)  [["created_at", "2023-03-13 14:18:04.263674"], ["updated_at", "2023-03-13 14:18:04.263674"], ["session_id", "750f7f6480d4a8611df9b0eb7d7e1fea"]]