app/controllers/carts_controller.rb

UPDATE "carts" SET "updated_at" = ?, "product_info" = ?, "total" = ? WHERE "carts"."id" = ?  [["updated_at", "2023-03-14 01:37:17.612004"], ["product_info", "{\"1\":1}"], ["total", 59.99], ["id", 2]]
---
  def update
    product_info = JSON.parse(@cart.product_info)
    product_info ||= {}

    product_info[params[:id]] = params[:quantity].to_i

    @cart.product_info = JSON.dump(product_info)
    @cart.total = total_for_cart(product_info)
    @cart.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def total_for_cart(products)
    total = 0
    products.each do |k, v|
      product = Product.find(k)