app/controllers/product_categories_controller.rb

    def show
        @category = ProductCategory.find(params[:id])
---
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]