app/controllers/search_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%test%' OR description LIKE '%test%')
SELECT "users".* FROM "users" WHERE (email LIKE '%test%')
---
    def index
        @keyword = params[:keyword]
        @products = Product.where("name LIKE ? OR description LIKE ?", "%#{@keyword}%", "%#{@keyword}%")

        @users = User.where("email LIKE ?", "%#{@keyword}%")