app/models/audit_log_entry.rb

    def self.event(opts)
        begin
            self.create(
                event: opts[:event],
                actor_id: opts[:actor_id],
                target: opts[:target],
                ip_address: opts[:ip_address]
            )
---
INSERT INTO "audit_log_entries" ("event", "actor_id", "target", "ip_address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)