app/views/products/show.html.erb

SELECT 1 AS one FROM "reviews" WHERE "reviews"."product_id" = ? LIMIT ?  [["product_id", 1], ["LIMIT", 1]]
---
        <h2>Reviews</h2>
        <% if @product.reviews.empty? %>