app/views/layouts/application.html.erb

SELECT "product_categories".* FROM "product_categories"
---
                </li>
                <% ProductCategory.all.each do |category| %>